'''运算符的知识
计算计算符：+(相加),-(相减),*(相乘),/(相除,结果为浮点数),%(取模,结果返回余数),**(幂运算,结果返回x的y次幂),//(取整数,向下取整,返回商的整数部分)

关系运算符:==(等于,比较对象是否相等),!=(不等于,比较两个对象是否不相等),>(大于,返回x是否大于y),<(小于,返回x是否小于y),>=(大于等于,返回x是否大于等于y),<=(小于等于,返回x小于等于y)

逻辑运算符:not(not x ),表示逻辑非,若x为TRUE,则返回False,若x为False,则返回True;
and(x and y),表示逻辑与,若x为False,返回False,否则返回y的计算值
or(x or y),表示逻辑或,若x为True,返回x的值,否则返回y的计算值

位运算符:
& 按位与运算符 参与运算的两个值，如果两个相应位结果都为1，则结果为1，否则为零
| 按位或运算符 只要两个二进制数所对应的两个二进制为有一个1，则返回结果为1
^ 按位异或运算符 如果两个比较数的对应二进制数位相异时，结果为1
~ 二进制数对应的每个二进制为取反，即将1变0，将0变1
<< 左移动运算符 运算数所有二进制位向左移若干位，由<<操作符右边的数字指定移动位数，高位丢弃，低位补0
>> 右移动运算符 运算数所有二进制位向右移若干位，由>>操作符右边的数字指定移动位数，高位丢弃，低位补0
'''
